Tekla Open API Reference for Tekla Structures 2025
Settings Methods
The Settings type exposes the following members.
Methods
Name | Description
GetValue
 Gets the value of the setting with the given name.
SetValue
 Sets a setting to a value.
TryGetValue(String, Object)
 Tries to get the value of the setting with the given name.
TryGetValue<T>(String, T)
 Tries to get the value of the setting with the given name and given object type.
Top
See Also
Reference
Settings Class
Tekla.Structures.Datatype Namespace